// একটা if কন্ডিশনের মধ্যে 'false' লিখে চেক কর। 'false' কি সত্য টাইপের ভ্যালু হিসেবে আচরণ করে, নাকি করে না।

if('false'){
    console.log('this is runs')
}

// একটা খালি অবজেক্টে { } কোনো প্রোপার্টি নাই। এইটা কী falsy একটা ভ্যালু। চেক কর if-এর ভিতরে শর্ত হিসেবে লিখে। 
 const object = {}
if(object){
    console.log('good')
}


// একটা খালি অ্যারে [ ] কোনো উপাদান নাই। এইটা কি truthy ভ্যালু। চেক কর if-এর ভিতরে শর্ত হিসেবে লিখে। 

const arr = [];
if(arr){
    console.log('good')
}

// একটা অ্যারে [ ] আছে, এইটার সামনে !! দিলে কী পাওয়া যাবে। 

const r = !!arr;
console.log(r)